Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: This presents a significant advantage to other methods, such as the "password" method (defined in [SSH-USERAUTH]), as new (presumably stronger) methods may be added "at will" and system security can be transparently enhanced.
ja: これは, ([SSH-USERAUTH] で定義されている) "password" 方式のような他の方法に対して非常に有利である. 新しい(おそらくより強固な)方法が "思いのままに" 追加できるので, システムのセキュリティは透過的に強化できる.

source: This is discussed in much greater detail in Section 6 of [RFC2104].
ja: より詳しい議論が, [RFC2104]の 6 節にある.

source: 38 IXON Enable output flow control.
ja: 38 IXON 出力のフロー制御を有効にする.

source: o Specific key exchange method messages (30 to 49).
ja: o 鍵交換法特有のメッセージ (30 to 49).

source: Version 1 was used by an early draft of this document.
ja: この文書の初期のドラフトで, バージョン1が使われていた.

source: It is RECOMMENDED, but not REQUIRED, that implementations reject certificates for which the certificate status is revoked.
ja: 実装は, 証明書状態が取り消されている証明書を拒否することが推奨されるが, 要求はされていない.

source: The major goal of this method is to allow the SSH client to support a whole class of authentication mechanism(s) without knowing the specifics of the actual authentication mechanism(s).
ja: この方法の主な目的は, SSH クライアントが認証メカニズムの具体形な仕様を知らなくても認証メカニズムをサポートできるようにすることだ.

source: The following compression methods are currently defined:
ja: 次の圧縮アルゴリズムが現在定義されている:

source: Another alternative to recommendation (1) would be to switch from basic HMAC to a another MAC, such as a
ja: 推薦(1)の別の代替手段に, 基本的なHMACから, 自身の内部カウンタを持つMACのような, 別のMACに切り替えることがある.

source: The 'command' string may contain a path.
ja: 'command' 文字列はパスを含んでもよい.

source: If compression has been negotiated, this field is compressed.
ja: 圧縮(すること)が取り決められていたなら, このフィールドは圧縮される.

source: This is believed to significantly improve usability in the short term, until widespread Internet public key infrastructures emerge.
ja: (訳注: とはいえ, ) 広範なインターネット鍵基盤が現われるまでの短い期間, このやり方は非常に利便性を向上すると考えられる.

source: If BREAK duration request of less than 500 ms is received, it SHOULD be interpreted as a 500 ms BREAK since most devices will recognize a BREAK of that length.
ja: BREAKの持続時間が 500 msよりも小さいリクエストを受け取ったら, 500 ms BREAK と解釈される必要がある. 多くのデバイスでこの長さが BREAKと認識されるからだ.

source: If the 'comments' string is included, a 'space' character (denoted above as SP, ASCII 32) MUST separate the 'softwareversion' and 'comments' strings.
ja: 'comments' 文字列が含まれる場合, 'space' 文字(上では SP で示した. ASCII 32) が 'softwareversion' と 'comments' を区切らなければならない..

source: Message numbers in the 192 to 255 range (local extensions) are reserved for PRIVATE USE, also as described in [RFC2434].
ja: 192から255までの(ローカルな拡張の)メッセージ番号は, やはり [RFC2434]に記述されている, プライベートな利用(PRIVATE USE)に予約されている.

source: Fingerprint
ja: 指紋

source: Generate ephemeral key pair.
ja: 一時鍵ペアの生成

source: Note that the client can still filter connections based on information passed in the open request.
ja: クライアントがこのオープンな要求で送られた接続の情報をさらにフィルタすることがあるのに注意.

source: Instead, all authentication data should be entered via the keyboard.
ja: かわりに, すべての認証データはキーボードから入力される必要がある.

source: GSS-API-Authenticated Diffie-Hellman Key Exchange ...............3 2.1.
ja: GSS-API に認証された Diffie-Hellman 鍵交換 ..............3 2.1.

source: Signing and verifying using the x509v3-ssh-dss key format is done according to the Digital Signature Standard [FIPS-186-3] using the SHA-1 hash [FIPS-180-2].
ja: x509v3-ssh-dss 鍵フォーマットでの署名と検証は, SHA-1 ハッシュ [FIPS-180-2] を用いるDigital Signature Standard [FIPS-186-2] に従って行なわれる.

source: Key exchange (kex) begins by each side sending name-lists of supported algorithms.
ja: 鍵交換 (kex) は, それぞれの側がサポートするアルゴリズムの名前のリストを送ることで始まる.

source: The public key algorithm for signing is negotiated with the SSH_MSG_KEXINIT messages.
ja: 署名に用いる公開鍵アルゴリズムは, SSH_MSG_KEXINIT メッセージで取り決める.

source: C calls GSS_Init_sec_context(), using the most recent reply token received from S during this exchange, if any.
ja: C は GSS_Init_sec_context() を呼ぶ. この交換でSから最も最近受信した応答トークンがあれば, それを用いる.

source: ECDH Message Numbers
ja: ECDH メッセージ番号

source: The User-based Security Model (USM) [RFC3414] is a mandatory-to- implement Security Model in STD 62.
ja: User-based Security Model (USM) [RFC3414] は STD62 のセキュリティモデルを実装することが義務付けられている.

source: Public Key Fingerprints .........................................6 5.
ja: 公開鍵の指紋 .........................................6 5.

source: These keys will remain constant until a re-exchange results in the formation of a new SSV.
ja: これらの鍵は, 新しい SSV を生成する再交換が行なわれるまでは一定の保持される.

source: Both the 'protoversion' and 'softwareversion' strings MUST consist of printable US-ASCII characters, with the exception of whitespace characters and the minus sign (-).
ja: 'protoversion' と 'softwareversion' は, 空白とマイナス(-)を除く印刷可能な US-ASCII 文字で構成されなければならない.

source: The client only knows the CA root key, and can verify the validity of all host keys certified by accepted CAs.
ja: クライアントは, CAのルート鍵のみを知っていれば受けいれているCAが保証したすべてのホスト鍵の正当性を検証できる.

source: o Header continuation uses a backslash at the end of the continued line rather than whitespace at the start of the next line.
ja: o ヘッダの継続に, 次の行の最初に空白ではなく, 継続される行の末尾にバックシュラッシュを用いる.

source: However, this attack is deemed difficult and not considered fully practicable, especially if relatively long block sizes are used.
ja: しかし, 特に長めのブロックサイズを利用している場合には, この攻撃は難しいと考えられ十分に実行可能とはみなされていない.

source: "reverse-forward" specifies that no "tcpip-forward" requests should be accepted, except for the port numbers in the comma-separated list supplied as a value to this attribute.
ja: "reverse-forward" は, この属性の値として与えられたカンマ区切りリストで指定されたホストへのものを除いて, "tcpip-forward" 要求が受けいれられないことを指定する.

source: Zero dimension parameters MUST be ignored.
ja: 次元パラメータが0の場合は無視されなければならない.

source: This is implemented with the following messages.
ja: これは, 次のメッセージ群で実装される.

source: An SSH Transport-Model-compliant implementation MUST use an SSH connection that provides authentication, data integrity, and encryption that meets the highest level of SNMP security (authPriv).
ja: SSH トランスポートモデルに準拠する実装は, SNMP セキュリティのもっとも高いレベル (authPriv) を満たす認証とデータの完全性, 暗号化を提供する SSH 接続を用いなければならない.

source: This document recommends that channel bindings SHOULD NOT be specified in the calls during context establishment.
ja: コンテキストの確立の間呼出でチャンネルの束縛を指定しないほうがよいと, この文書は推奨する.

source: The userauth type "keyboard-interactive" is used for this authentication method.
ja: userauth のタイプ "keyboard-interactive" がこの認証法のために使われる.

source: The resulting channels are independent of the session, and closing the session channel does not close the forwarded X11 channels.
ja: 開始されたチャンネルはセッションには独立で, セッションチャンネルが終了しても転送されたX11のチャンネルは終了されない.

source: If a client system is unable to securely determine which targ_name to use, then it SHOULD NOT use this mechanism.
ja: クライアントシステムが, 利用する targ_name を安全に決定できないなら, このこのアルゴリズムを利用しないほうがよい.

source: In the second and third chunks quoted above, each line is terminated by a LineFeed.
ja: 上記で引用した2番目と3番目のチャンクでは, それぞれの行はラインフィードで終端されている.

source: IANA has opened a new registry for the SSHFP RR type for fingerprint types.
ja: IANA は, 指紋のタイプのための SSHFP RR タイプの新しいレジストリを開いた.

source: If the server has been compromised, any terminal sessions, port forwarding, or systems accessed on the host are compromised.
ja: サーバが侵害されていると, あらゆる端末セッション, ポート転送, ホストにアクセスするシステムが, 侵害される.

source: For example, implementations may store X as multiple unsigned 32-bit counters.
ja: たとえば, 実装は複数の符号なし32-bitカウンタとしてXを保持してよい.

source: MIB Module Overview ............................................21 6.1.
ja: MIB モジュールの概要 ............................................21 6.1.

source: Another dependency is on the implementation of DNSSEC itself.
ja: 別に依存している部分にDNSSEC自体の実装がある.

source: Starting NETCONF over SSH .
ja: SSH 上での NETCONF の起動 .

source: Thus, replay_det_req_flag and sequence_req_flag need not be set for this process.
ja: このため, replay_det_req_flag と sequence_req_flag はこのプロセスでは設定する必要がない.

source: It MUST exactly include any "user@" prefix associated with the address provided to the openSession() ASI.
ja: これは, openSession() ASI で提供されたアドレスに関連する "user@" プレフィックスを必ず含んでいなければならない.

source: Since this key exchange method does not require the host key to be used for any encryption operations, this message is OPTIONAL.
ja: この鍵交換法は暗号の操作でホスト鍵を利用しないので, このメッセージは選択できる.

source: In the event that public key files are not transferred as text files, implementations SHOULD be prepared to read files using any of the common line termination sequence, <CR>, <LF>, or <CR><LF>.
ja: 公開鍵ファイルがテキストファイルとして転送されない場合があるので, 一般的な行終端文字 <CR> と, <LF>, <CR><LF> を用いるファイルすべてを読めるように実装は準備しなければならない.

source: Some management objects defined in other MIB modules are applicable to an entity implementing the SSH Transport Model.
ja: 他の MIB モジュール内で定義されたいくつかの管理オブジェクトは, SSHトランスポートモデルを実装するエンティティに適用できる.

source: Pixel dimensions refer to the drawable area of the window.
ja: pixel 次元は, ウィンドウの描画可能領域を参照する.

source: It is not intended as a Public Key Infrastructure for X.509 Certificates (PKIX) replacement.
ja: これは, X.509 証明書ベースの公開鍵基盤 (PKIX) の代替を意図していない.

source: Elements of Procedure
ja: 手順の要素

source: Each of these methods specifies GSS-API authenticated Diffie-Hellman key exchange as described in Section 2.1 with SHA-1 as HASH, and the group defined in Section 8.2 of [SSH-TRANSPORT].
ja: この種類のメソッドのそれぞれは， 2．1 節で記述した SHA-1をHASHとするGSS-APIで認証される Diffie-Hellman 鍵交換 と [SSH-TRANSPORT]の8．2節で定義した群を指定します．

source: Secure Shell Transport Model Cached Information
ja: セキュアシェルトランスポートモデルのキャッシュされる情報

source: This is purely coincidental and has nothing to do with STD 11 [RFC0822].
ja: これは, 単なる偶然でありSTD 11 [RFC0822]とは関係ない.

source: Any public key algorithm may be offered for use in authentication.
ja: どんな公開鍵アルゴリズムが認証のために提供されても構わない.

source: In order for the "external-keyx" user authentication method to be used, it MUST have access to user authentication information obtained as a side-effect of the key exchange.
ja: "external-keyx" ユーザ認証法を利用するためには, 鍵交換の副作用として得られたユーザ認証情報にアクセスしなければならない.

source: The 'authentications that can continue' is a comma-separated name- list of authentication 'method name' values that may productively continue the authentication dialog.
ja: 'authentications that can continue' は, 認証のやりとりを続行できる認証の 'method_name' の値のコンマ区切りのリストだ.

source: This message will request that the server start the execution of the given command.
ja: このメッセージは, サーバが与えられたコマンドを実行することを要求する.

source: The "aes128-ctr" method uses AES (the Advanced Encryption Standard, formerly Rijndael) with 128-bit keys [AES].
ja: "aes128-ctr" は, 128-bit 鍵を用いる AES (Advanced Encryption Standard, 以前は Rijndael) を使う[AES].

source: One useful technique is to select the generator, and then limit the modulus selection sieve to primes with that generator:
ja: 1つの有用なテクニックとして, 生成器を選択し法(modulus)の選択の篩をその生成器の素数に限する, というものがある.

source: Implementers should also check to see which ciphers are considered to be relatively stronger than others and should recommend their use to users over relatively weaker ciphers.
ja: 実装者は, さらに, どの暗号が相対的に優れているかチェックし相対的に弱い暗号を利用しているユーザに優れている暗号の利用を勧める必要がある

source: Any major status code other than GSS_S_COMPLETE or GSS_S_CONTINUE_NEEDED SHOULD be a failure.
ja: GSS_S_COMPLETE と GSS_S_CONTINUE_NEEDED 以外の major status コードは失敗とする必要がある．

source: The User Authentication Protocol authenticates the client to the server.
ja: ユーザ認証プロトコルは, クライアントをサーバに認証する.

source: It is the responsibility of the server implementation to enforce any access controls that may be required to limit the access allowed for any particular user (the user being authenticated externally to this protocol, typically using the SSH User Authentication Protocol [3]).
ja: (このプロトコルの外部, 特に SSHユーザ認証プロトコル [3] を用いてユーザを認証して) 特定のユーザにアクセスを制限するために必要なアクセス制御を実施するのはサーバの実装の責任だ.

source: Reserved Messages
ja: 予約されたメッセージ

source: The main purpose of introducing this public key format is to provide an RSA- based public key format that is compatible with current recommendations on key size and hash functions.
ja: この鍵形式を導入する主な目的は, 鍵サイズとハッシュ関数の現在の勧告と互換する RSA ベースの公開鍵形式を提供することだ.

source: If the user name is not authorized, then the authentication MUST fail.
ja: ユーザ名が認可されていなければ， 認証は失敗しなければならない．

source: Note that the use of the "null" algorithm in this way means that the server will not be able to interoperate with clients that do not support this algorithm.
ja: 注意: このような"null" アルゴリズムの利用は, このアルゴリズムをサポートしないクライアントとサーバが相互運用できないことを意味する.

source: The following table identifies the initial assignments of the SSH_MSG_DISCONNECT 'description' and 'reason code' values.
ja: 次の表で, SSH_MSG_DISCONNECT の 'description' と 'reason code' の値の初期の割り当てを示す.

source: The Secure Shell (SSH) Protocol is a protocol for secure remote login and other secure network services over an insecure network.
ja: セキュア シェル (SSH) プロトコルは, 安全ではないネットワーク上での安全なリモートログインや他の安全なネットワークサービスのためのプロトコルだ.

source: SSH provides for verification of the identity of the SSH server through the SSH transport protocol server authentication [RFC4253].
ja: SSH は, SSH トランスポートプロトコルのサーバ認証 [RFC4253] を通じて SSH サーバの識別情報の検証を提供する.

source: If the tmTransportAddress field contains a user name followed by an '@' character (US-ASCII 0x40), that user name string should be presented to the SSH server as the "user name" for user-authentication purposes.
ja: tmTransportAddress フィールドが ユーザ名に続く '@' (US-ASCII 0x40) 文字を含んでいたら, ユーザ認証目的の "ユーザ名" として そのユーザ名がSSHサーバに示される必要がある.

source: 14 Appendix A. Example .
ja: 14 Appendix A. 例 .

source: As a general rule, if state information is available when a message gets discarded, the message-state information should also be released, and if state information is available when a session is closed, the session-state information should also be released.
ja: 一般的なルールとして, メッセージが破棄される際に状態情報が利用可能なら, メッセージの状態情報も開放される必要がある. セッションが閉じる際に状態情報が利用可能なら, セッションの状態情報も開放される必要がある.

source: statusInformation = closeSession( IN tmSessionID -- session ID of session to be closed )
ja: statusInformation = closeSession( IN tmSessionID -- 終了するセッションのID )

source: For example, an implementation SHOULD NOT discard the name field because its windows lack titles; instead, it SHOULD find another way to display this information.
ja: 例えば, 実装はウィンドウにタイトルがないからといって name フィールドを破棄しないほうがよい. この情報を表示する別の方法を見つける必要がある.

source: Security Parameter Passing
ja: セキュリティパラメータの転送

source: Some usages of these lowercase terms are simply normal English usage.
ja: これらの小文字の用語のいくつかの用法は, 単に普通の英語の用法だ.

source: As stated in Section 2.2, we recommend that SSH implementors provide a policy mechanism to control the order of methods used for host key verification.
ja: 2.2節で述べたように, SSHの実装者がホスト鍵の検証法の順番を制御するポリシー機構を提供することを推奨する.

source: So, NETCONF should only be used over communications channels that provide strong encryption for data
ja: それゆえ, NETCONF は, データの秘密性に対して強い暗号化を提供する通信チャンネル上でのみ利用されなければならない.

source: Conventions .........................................9 4.4.2.
ja: 規約 .........................................9 4.4.2.

source: Summary of Message Numbers ....................................27 13.
ja: メッセージ番号のまとめ.................................27 13.

source: Briefly, (1) is designed to protect against information leakage through the SSH protocol's underlying MAC, and (2) is designed to protect against information leakage through the SSH protocol's underlying encryption scheme.
ja: 簡潔に言うと, (1) は SSHプロトコルの基底にあるMACからの情報漏洩を防ぐために設計されている. そして (2) はSSHプロトコルの基底にある暗号方式からの情報漏洩を防ぐために設計されている.

source: This message causes immediate termination of the connection.
ja: このメッセージは, 接続を直ちに終了させる.

source: The initial assignments for the 'reason code' values and 'description' values are given in the table below.
ja: 'reason code' の値と 'description' の値の初期の割り当ては, 次の表で示されている.

source: The meaning of these is as follows:
ja: これらの意味は以下の通り:

source: The used data types and terminology are specified in the architecture document [RFC4251].
ja: 利用しているデータのタイプと用語は, アーキテクチャ文書 [RFC4251] で定義されている.

source: If L is at least 128, then SSH implementations should also attempt to force a rekey before receiving more than 2**(L/4) blocks.
ja: また, L が128 以上の場合, SSHの実装は 2**(L/4) ブロック以上を受信する前に鍵の再生成を強制的に行なわなければならない.

source: Key Words
ja: キーワード

source: could be encoded as (using '\n' as a visible representation of the LineFeed character):
ja: は, 以下のようにエンコードされる ('\n' はラインフィード文字の可視表現として用いる):

source: With the generic method defined here, clients will not require code changes to support new authentication mechanisms, and if a separate authentication layer is used, such as [PAM], then the server may not need any code changes either.
ja: ここで定義する一般的な方法を用いると, クライアントは新しい認証メカニズムをサポートするためにコードを変更する必要がなくなる. また, [PAM]のような分離された認証層を用いているなら, サーバもコードの変更が必要ないかもしれない.

source: However, if the client reads the responses in some other encoding (e.g., ISO 8859-1), it MUST convert the responses to ISO-10646 UTF-8 before transmitting.
ja: ただし, クライアントが他のエンコーディング(例: ISO 8859-1) で応答を読んだ場合でも, クライアントは転送の前に ISO-10646 UTF-8 に変換しなければならない.

source: * If the resulting major_status code is GSS_S_COMPLETE and the mutual_state flag is not true, then mutual authentication has not been established, and the key exchange MUST fail.
ja: * 結果の major_status コードが GSS_S_COMPLETE で mutual_state フラグが trueでなければ, 相互認証は確立していないので鍵交換は失敗しなければならない.

source: 'request type' names follow the DNS extensibility naming convention outlined in [SSH-ARCH] and [SSH-NUMBERS].
ja: 'request type' の値は, [SSH-ARCH] と [SSH-NUMBERS] で説明されている DNS 拡張命名規則に従う.

source: A user (or application) could use the following command line to invoke NETCONF as an SSH subsystem on the IANA-assigned port:
ja: ユーザ(やアプリケーション)は, IANAに割り当てられたポート上の SSH サブシステムとして NETCONF を, 以下のコマンドラインを用いて起動できる.

source: The Header-value MUST NOT be more than 1024 8-bit bytes.
ja: Header-value は 1024 8-bit バイトと越えてはならない.

source: In order to facilitate key re-exchange after the user's GSS-API credentials have expired, client implementations SHOULD store host keys received via SSH_MSG_KEXGSS_HOSTKEY for the duration of the session, even when such keys are not stored for long-term use.
ja: ユーザの GSS-API 認証の期限が切れたあとで鍵の再交換を支援するため, クライアントの実装は, SSH_MSG_KEXGSS_HOSTKEY で受け取ったホスト鍵を, 長期間保持しない場合でも, セッションの持続中は保持する必要がある.

source: Recommendation (2) states that SSH implementations should rekey before encrypting more than 2**(L/4) blocks with the same key (assuming L is at least 128).
ja: 推奨 (2) は, (ブロック暗号のブロックサイズ L が少なくとも128bitの場合に) 同じ鍵で 2**(L/4) より多くの暗号化をする前にSSHの実装が鍵を再生成すべきと述べている.

source: The associated Extended Channel Data Transfer 'data' is a human-readable message that describes the type of data allowed to be transferred in the channel.
ja: 関連する拡張チャンネルデータ転送の 'data' は, チャンネルで転送されるデータの種類を示した人間が解読できるメッセージだ.

source: One such aspect is in which order fingerprints are looked up (e.g., first checking local file and then SSHFP).
ja: この一つの面が, どの順番で指紋を検索するかだ(例えば, 最初にローカルファイルを検査し次にSSHFPをチェック).

source: The 'channel type' is a name, as described in [SSH-ARCH] and [SSH-NUMBERS], with similar extension mechanisms.
ja: 'channel type' は名前で, [SSH-ARCH] と [SSH-NUMBERS] に記述されたような拡張のメカニズムを持つ.

source: The Public Key Subsystem provides a server-independent mechanism for clients to add public keys, remove public keys, and list the current public keys known by the server.
ja: この公開鍵サブシステムは, 公開鍵を追加したり削除したりサーバが知っている現在の公開鍵の一覧を取得する, サーバに依存しないメカニズムをクライアントに提供する.

source: The 'encoded terminal modes' value is a byte stream of opcode-argument pairs.
ja: 'encoded terminal modes' の値は, オペコード-引数のペアのバイトストリームだ.

source: To simplify the elements of procedure, the release of state information is not always explicitly specified.
ja: 手順の要素を単純にするため, 状態情報の開放は常に明示的に指定されていない.

source: In summary, the use of this protocol without a reliable association of the binding between a host and its host keys is inherently insecure and is NOT RECOMMENDED.
ja: まとめとして, ホストとそのホスト鍵の間に信頼できる関係がない場合にこのプロトコルを利用することは, 本質的に安全ではなく推奨されない.

source: The "serpent192-ctr" method uses Serpent with 192-bit keys.
ja: "serpent192-ctr" は 192-bit 鍵を用いる Serpent を使う.

source: The sender MUST NOT send or receive any data after this message, and the recipient MUST NOT accept any data after receiving this message.
ja: 送り手は, このメッセージの後でどんなデータも送ったり受け取ったりしてはならない. 受け取り手はこのメッセージを受け取った後でどんなデータも受け取ってはならない.

source: The number of 'mac' bytes depends on the algorithm chosen.
ja: 'mac' のバイト数は, 選ばれたアルゴリズムに依存する.

source: 1) The tag cannot be verified until we parse the binary packet.
ja: 1) バイナリパケットをパースするまでタグが検証できない.

source: Data Integrity ............................................12 7.
ja: データ完全性 ............................................12 7.

source: A principal can be, among other things, an individual acting in a particular role, a set of individuals each acting in a particular role, an application or a set of applications, or a combination of these within an administrative domain.
ja: principal は,特定の役割を行なう個人や, 特定の役割を行なう個人の集合, アプリケーションやアプリケーションの集合, 管理ドメイン内でのそれらの組合せ, を特に意味する.

source: If the server supports any of the requested mechanism OIDs, the server sends an SSH_MSG_USERAUTH_GSSAPI_RESPONSE message containing the mechanism OID.
ja: サーバが要求されたメカニズムのOIDのどれかをサポートしていたら， サーバはメカニズムのOIDを含む SSH_MSG_USERAUTH_GSSAPI_RESPONSE を返す．

source: Different SnmpSSHAddress values (with different hostnames, "user@" prefix names, and/or port numbers) will each result in individual SSH sessions.
ja: (ホスト名やユーザ名, ポート番号のそれぞれないしすべてが)異なる SnmpSSHAddress の値 は, それぞれ 別々の SSH セッションとなる.

source: This protocol makes no assumptions or provisions for an infrastructure or means for distributing the public keys of hosts.
ja: このプロトコルでは, ホストの公開鍵を配布する基盤や手段について仮定もしくは準備はない.

source: These names MUST be printable US-ASCII strings, and MUST NOT contain the characters at-sign ("@"), comma (","), whitespace, control characters (ASCII codes 32 or less), or the ASCII code 127 (DEL).
ja: これらの名前は, 表示可能なUS-ASCIIの文字列で,アットマーク("@"), コンマ (","), スペース, 制御文字(ASCIIコード 32以下), ASCIIコードの127 (DEL)を含んではならない.

source: A session is a remote execution of a program.
ja: セッションは, プログラムのリモートな実行だ.

source: Second Rekeying Recommendation .............................3 4.
ja: 鍵の再生成についての2番目の推奨 .............................3 4.

source: This document describes a method of verifying Secure Shell (SSH) host keys using Domain Name System Security (DNSSEC).
ja: この文書は, Domain Name System Security (DNSSEC) を使ったセキュア シェル (SSH) ホスト鍵の検証法を記述している.

source: Otherwise, the re-exchange protocol is identical to the initial key exchange protocol.
ja: それ以外は, 再交換プロトコルは最初の鍵交換プロトコルと同一だ.

source: The key type MUST always be explicitly known (from algorithm negotiation or some other source).
ja: 鍵の種類は, (アルゴリズムの取り決めや他のソースによって)常に明示的に知られてなければならない

source: ECDSA is specified in [SEC1].
ja: ECDSA は [SEC1] で指定されている.

source: Each packet is in the following format:
ja: パケットは以下のフォーマットに従う:

source: The part following the at-sign MUST be a valid, fully qualified domain name [RFC1034] controlled by the person or organization defining the name.
ja: アットマークに続く部分は, 名前を定義する個人ないし組織で管理されている有効な完全に記述したドメイン名 [RFC1034]でなければならない.

source: Record 2 is not at the beginning of the TCP segment and never will be because it gets ACKed.
ja: Record 2 は, TCPセグメントの先頭ではなく今後も先頭にはならない. ACKが受け取られたからだ.

source: In theory, one could argue that encryption of the entire binary packet means that the secure shell dataflow becomes a featureless octet stream.
ja: 理論的には, 全バイナリパケットの暗号化が, セキュアシェルデータフローを特徴のないオクテットストリームにすることを意味していると主張するものがいる.

source: Though this feature greatly simplifies the security analysis of any system using AES-GCM, this creates an incompatibility with the requirements of secure shell, as we shall see in Section 7.3.
ja: この特徴は AES-GCM を用いるシステムのセキュリティ解析を非常に単純にするが, セキュアシェルの要件との不整合を生む. 7.3 節でこの点に触れる.

source: o in the SSH_MSG_KEX_ECMQV_REPLY message [RFC5656]
ja: o SSH_MSG_KEX_ECMQV_REPLY メッセージ内 [RFC5656]

source: Authentication Protocol Message Numbers .........................8 7.
ja: 認証プロトコルのメッセージ番号.........................8 7.

source: After sending SSH_MSG_USERAUTH_SUCCESS, the server starts the requested service.
ja: サーバは, SSH_MSG_USERAUTH_SUCCESS を送ったら, 要求されたサービスを始める.
